ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/R5SS_TCMA_CORE0_ROM_00000000h.xml
<module name="TCMA_CORE0_ROM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TCMA_CORE0_ROM_START" acronym="TCMA_CORE0_ROM_START" offset="0" width="32" description="">
		<bitfield id="ROM_START" width="32" begin="31" end="0" resetval="0x0" description="ROM start address of master sub system tcma" range="31:0" rwaccess="R"/>
	</register><register id="TCMA_CORE0_ROM_END" acronym="TCMA_CORE0_ROM_END" offset="131068" width="32" description="">
		<bitfield id="ROM_END" width="32" begin="31" end="0" resetval="0x0" description="ROM end address of master sub system tcma" range="31:0" rwaccess="R"/>
	</register>
</module>